Bars are too close together. Decrease the Number Of Lines parameter.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BarsTooCloseNumber { get; }
  Visual Basic
Public Shared ReadOnly Property BarsTooCloseNumber As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BarsTooCloseNumber {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarSystemFailures Class
  Autodesk.Revit.DB Namespace